import React from 'react';
import './Ans.css'

const Ans = () => {
    return (
        <div>
            <div className="fast-ans">
                <h2>How react work</h2>
                <p>React ইউজার ইন্টারফেস তৈরির জন্য একটি জাভাস্ক্রিপ্ট লাইব্রেরি .
                </p>
                <p>React এর মাধ্যমে খুব সহযে  ইউজার ইন্টারফেস তৈরি করা যায় ।
                </p>
                <p>React এর ভিতর পিওর জাভাস্ক্রিপ্ট  কোড ও লিখা যায় ।
                </p>
                <p>আমরা যে কোড গুল লিখি React  সেই গুল কে জাভাস্ক্রিপ্ট   এতে কনভার্ট করে নিয়ে কাজ করে থাকে ।</p>
                <p>React কম্পোনেন্ট একটি render() মেথড তৈরি করে যা ইনপুট ডেটা নেয় এবং কী দেখাতে হবে তা প্রদান করে। </p>
                <p>এই ভাবে React  কাজ করে থাকে মুলুত</p>
            </div>
            <div className="secend-ans">
                <h2>props and state difference</h2>
                <p>props and state উভয়ই একটি রেন্ডার আপডেট  করে।</p>
                <p>state হল কম্পোনেন্ট ডেটা যা ভিতর থেকে ম্যানেজ করা হয়</p>
                <p>props হল কম্পোনেন্ট ডেটা যা উপরে থেকে ম্যানেজ করা হয় এবং পাস করা হয়</p>
                <p> props মূল উপাদান থেকে ডেটা গ্রহণ করার ক্ষমতা দিয়ে উপাদানগুলিকে পুনরায় ব্যবহারযোগ্য করে তোলে। </p>
                <p>state হল একটি ডেটা স্ট্রাকচার যা একটি কম্পোনেন্ট মাউন্ট করার সময় একটি ডিফল্ট মান দিয়ে শুরু হয়</p>
                <p>এটি সময় জুড়ে পরিবর্তিত হতে পারে</p>
            </div>
        </div >
    );
};

export default Ans;